
bot_token = '6023889947:AAEFVpdf_oRq9WSCRptoE52ukSApHyOUcfo'  # Токен бота Telegram
CHANNEL_ID = 5658707449 # id канала, куда будет отсылаться информация, id без -100 в начале (например: 124873248) (узнать его можно в @getmyid_bot)

admin_id_1 = 5658707449 # id первого администратора
admin_id_2 = 5658707449 # id второго администратора

bot_login = 'kumarshopdr_bot' # Айди бота (без @) например, Gydra24 (узнать его можно в @getmyid_bot)
ref_percent = 10 # Процент реферальной системы

QIWI_NUMBER = '79254061089'    # номер Qiwi (Без знака "+")
QIWI_TOKEN = ''           # токен Qiwi
btc = 'bc1qpjfxdh3j6y86gxnmztdvga4kjhccq8zv5czkqx' # Адрес биткойн
worker_procent = 80  # Процент воркеров


# Покупка товара
text_purchase = '❕ Вы выбрали: ' \
                '{name}\n\n' \
                '{info}\n\n' \
                '💲 Цена: {price} рублей\n' \
                '🏴 Количество товара: {amount}' \


# Информация
info = " Все наши сотрудники проходят обучение в соответствии с высокими стандартами безопасности. Их безопасность - это безопасность наших клиентов.\n" \
    "\n" \
    "Все клады делаются надежным способом, вероятность их подрыва равносильна вероятности форс мажора (убрали забор, перекопали землю и т.д.). \n" \
    "\n" \
    "Товар проходит двух этапное тестирование. Сначала мы тестируем то, что предлагают наши поставщики, а потом мы тестируем уже приобретенный товар. Наши клиенты могут быть всегда уверены в высочайшем качестве любой позиции из ассортимента. \n" \
    "\n" \
    "Работа каждого участника в команде контролируется, честность это принципиальное правило. \n\n" \
    " 1) Клады делаются на магнитах в городской черте, в пешей доступности от метро или крупных транспортных узлов. Закапываются в случае, если делаются в лесу или парке. \n" \
    " \n" \
    " 2) Персональные, комбинированные и заказы на опт, исполняются в течение 24 часов после оплаты.\n" \
    " \n" \
    " 4) Убедительно просим вас быть тактичными и адекватными при решении проблем, это ,однозначно, повлияет на положительную атмосферу в процессе решения проблемы и очевидно на ее результат.\n" \
    " \n" \
    " 5) Более одного перезаклада не выдается.\n" \
    " \n" \
    " 6) Решения по бесплатным пробам обсуждаются с владельцем магазина.\n" \
    "〰️〰️〰️〰️〰️〰️〰️〰️\n" \
    "😕 НЕНАХОД!?: 😕\n" \
    "〰️〰️〰️〰️〰️〰️〰️〰️\n" \
    "1) Если у вас какая-либо  проблема с нахождением клада, то обязательно сделайте два фото местности: со стороны и место где должен был располагаться клад. \n" \
    "(если не сделали - придется ехать еще раз).\n" \
    " \n" \
    "2) Если клад в парке или лесу то попробуйте покопать поглубже и вокруг в радиусе 15см, пересмотрите выкопанную землю, возможны вы не заметили клад, откинув его вместе с землей и листвой.\n" \
    " \n" \
    "3) Напишите оператору поддержки в Telegram\n" \
    " \n" \
    "4) Одним сообщением сразу опишите ваши действия на месте клада, или что вам не понятно. Прикрепите фотографии.\n" \
    " \n" \
    "5) Дождитесь ответа оператора и курьера (первый ответ приходит в течении 12 часов после обращения).\n" \
    " \n" \
    "6) Если повторные поиски не помогли, тогда владелец будет рассматривать вопрос о перезакладе.\n" \
    " \n" \
    "7) Перезаклад не выдается просто так, так как в этой сфере слишком много халявщиков. Каждая ситуация подробно анализируется, к каждой ситуации персональный подход. На решение проблемной ситуации обычно уходит от суток до недели, в зависимости от сложности ситуации и того насколько оперативно клиент отвечает на наши вопросы и выполняет требования.\n"  \
    "Будьте, пожалуйста, терпеливы.\n" \

# Пополнение баланса
replenish_balance = '➖ Для оплаты, нажмите на кнопку "Оплатить" и совершите перевод необходимой суммы \n' \
                     '➖ После перевода, нажмите на кнопку "Проверить" \n' \
                     '➖ Комментарий оплаты вставится автоматически! \n' \
                     '➖ Принимаются платежи от 100 до 15 000 рублей'

# Профиль
profile = '🧛‍♀️ Профиль\n\n' \
          '❕ Ваш id - {id}\n' \
          '❕ Ваш логин - {login}\n' \
          '❕ Дата регистрации - {data}\n\n' \
          '💲 Ваш баланс - {balance} рублей'
